In [1]:
import pandas as pd
import numpy as np

In [2]:
dataset = pd.read_csv("DataSample.csv",sep=";")

In [3]:
dataset.head(n=10)

,gender,race/ethnicity,parental level of education,lunch,test preparation course,math score,reading score,writing score
0,female,group B,bachelor's degree,standard,none,72,72,74
1,female,group C,some college,standard,completed,69,90,88
2,female,group B,master's degree,standard,none,90,95,93
3,male,group A,associate's degree,free/reduced,none,47,57,44
4,male,group C,some college,standard,none,76,78,75
5,female,group B,associate's degree,standard,none,71,83,78
6,female,group B,some college,standard,completed,88,95,92
7,male,group B,some college,free/reduced,none,40,43,39
8,male,group D,high school,free/reduced,completed,64,64,67
9,female,group B,high school,free/reduced,none,38,60,50

In [32]:
dataset.shape

(1000, 8)

In [6]:
##adding a column in a Dataframe --1
Grand_Total_Score = dataset["math score"] + dataset["reading score"]+ dataset["writing score"]
dataset['Grand Total Score'] = Grand_Total_Score
dataset.head()

,gender,race/ethnicity,parental level of education,lunch,test preparation course,math score,reading score,writing score,Student Average Score,Grand Total Score
0,female,group B,bachelor's degree,standard,none,72,72,74,72.67,218
1,female,group C,some college,standard,completed,69,90,88,82.33,247
2,female,group B,master's degree,standard,none,90,95,93,92.67,278
3,male,group A,associate's degree,free/reduced,none,47,57,44,49.33,148
4,male,group C,some college,standard,none,76,78,75,76.33,229

In [5]:
##adding column in a Dataframe
Student_Avg_Score = round((dataset["math score"] + dataset["reading score"]+ dataset["writing score"])/3,2)
dataset['Student Average Score'] = Student_Avg_Score
dataset

,gender,race/ethnicity,parental level of education,lunch,test preparation course,math score,reading score,writing score,Student Average Score
0,female,group B,bachelor's degree,standard,none,72,72,74,72.67
1,female,group C,some college,standard,completed,69,90,88,82.33
2,female,group B,master's degree,standard,none,90,95,93,92.67
3,male,group A,associate's degree,free/reduced,none,47,57,44,49.33
4,male,group C,some college,standard,none,76,78,75,76.33
...,...,...,...,...,...,...,...,...,...
995,female,group E,master's degree,standard,completed,88,99,95,94.00
996,male,group C,high school,free/reduced,none,62,55,55,57.33
997,female,group C,high school,free/reduced,completed,59,71,65,65.00
998,female,group D,some college,standard,completed,68,78,77,74.33
999,female,group D,some college,free/reduced,none,77,86,86,83.00

In [7]:
dataset['Student Average Score'].min()

9.0

In [37]:
### autocompletion
%config Completer.use_jedi = False

In [41]:
grouped_dataset = dataset.groupby("gender")
grouped_dataset.count()

,race/ethnicity,parental level of education,lunch,test preparation course,math score,reading score,writing score,Grand Total Score
gender,,,,,,,,
female,518,518,518,518,518,518,518,518
male,482,482,482,482,482,482,482,482

In [90]:
grouped_dataset.mean()

        math score  reading score  writing score  Grand Total Score
gender
female   63.633205      72.608108      72.467181         208.708494
male     68.728216      65.473029      63.311203         197.512448

In [91]:
grouped_dataset.std()

,math score,reading score,writing score,Grand Total Score,Student Average Score
gender,,,,,
female,15.491453,14.378245,14.844842,43.625427,14.541667
male,14.356277,13.931832,14.113832,41.096520,13.698944

In [44]:
grouped_dataset2 = dataset.groupby("parental level of education")

In [45]:
grouped_dataset2.count()

,gender,race/ethnicity,lunch,test preparation course,math score,reading score,writing score,Grand Total Score
parental level of education,,,,,,,,
associate's degree,222,222,222,222,222,222,222,222
bachelor's degree,118,118,118,118,118,118,118,118
high school,196,196,196,196,196,196,196,196
master's degree,59,59,59,59,59,59,59,59
some college,226,226,226,226,226,226,226,226
some high school,179,179,179,179,179,179,179,179

In [48]:
### Does parent level of education has influence on student's average score
grouped_dataset2.mean()

,math score,reading score,writing score,Grand Total Score
parental level of education,,,,
associate's degree,67.882883,70.927928,69.896396,208.707207
bachelor's degree,69.389831,73.000000,73.381356,215.771186
high school,62.137755,64.704082,62.448980,189.290816
master's degree,69.745763,75.372881,75.677966,220.796610
some college,67.128319,69.460177,68.840708,205.429204
some high school,63.497207,66.938547,64.888268,195.324022

In [49]:
### what is the deviation/variation from the mean
grouped_dataset2.std()

,math score,reading score,writing score,Grand Total Score
parental level of education,,,,
associate's degree,15.112093,13.868948,14.311122,41.012743
bachelor's degree,14.943789,14.285250,14.728262,41.839827
high school,14.539651,14.132130,14.085907,40.531749
master's degree,15.153915,13.775163,13.730711,40.803051
some college,14.312897,14.057049,15.012331,41.132921
some high school,15.927989,15.479295,15.736197,44.952235

### Selecting two or more columns in DataFrame

In [53]:
dataset[["race/ethnicity","math score"]]

    race/ethnicity  math score
0          group B          72
1          group C          69
2          group B          90
3          group A          47
4          group C          76
..             ...         ...
995        group E          88
996        group C          62
997        group C          59
998        group D          68
999        group D          77

[1000 rows x 2 columns]

In [55]:
subset = dataset[["race/ethnicity","math score","gender"]]

In [57]:
### selecting columns in DataFrame using double [[]] creates another DataFrame
type(subset)

pandas.core.frame.DataFrame

In [62]:
language_Score = np.random.randint(45,100,1000)
language_Score.mean()

71.46

In [64]:
##checking the number of occurence --
frequency = pd.Series(language_Score).value_counts()

In [67]:
subset["Language Score"] = language_Score
subset

C:\Users\48502\AppData\Local\Temp/ipykernel_17216/2750175903.py:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  subset["Language Score"] = language_Score

    race/ethnicity  math score  gender  Language Score
0          group B          72  female              63
1          group C          69  female              93
2          group B          90  female              49
3          group A          47    male              62
4          group C          76    male              95
..             ...         ...     ...             ...
995        group E          88  female              84
996        group C          62    male              73
997        group C          59  female              45
998        group D          68  female              50
999        group D          77  female              71

[1000 rows x 4 columns]

In [68]:
dataset["math score"].sum()

66089

In [70]:
MathMaxScore = dataset["math score"].max()
MathMaxScore

100

### Exporting Back Your Cleaned Data

In [77]:
dataset.to_csv("CleanStudentExamScore.csv", index=False)

In [80]:
dataset['gender'].value_counts()

female    518
male      482
Name: gender, dtype: int64

In [87]:
## 358 students completed the test preparation course
dataset['test preparation course'].value_counts()



#obtain the % vaule
#dataset['test preparation course'].value_counts(normalize=True)

none         642
completed    358
Name: test preparation course, dtype: int64

In [83]:
###Does completing the preparation course has impact in the student's test score
preparation_course = dataset.groupby("test preparation course")

In [84]:
##students who completed prep course in average scored above 70 in all tests
preparation_course.mean()

,math score,reading score,writing score,Grand Total Score,Student Average Score
test preparation course,,,,,
completed,69.695531,73.893855,74.418994,218.008380,72.669469
none,64.077882,66.534268,64.504673,195.116822,65.038801

In [8]:
dataset.head(n=10)

,gender,race/ethnicity,parental level of education,lunch,test preparation course,math score,reading score,writing score,Student Average Score,Grand Total Score
0,female,group B,bachelor's degree,standard,none,72,72,74,72.67,218
1,female,group C,some college,standard,completed,69,90,88,82.33,247
2,female,group B,master's degree,standard,none,90,95,93,92.67,278
3,male,group A,associate's degree,free/reduced,none,47,57,44,49.33,148
4,male,group C,some college,standard,none,76,78,75,76.33,229
5,female,group B,associate's degree,standard,none,71,83,78,77.33,232
6,female,group B,some college,standard,completed,88,95,92,91.67,275
7,male,group B,some college,free/reduced,none,40,43,39,40.67,122
8,male,group D,high school,free/reduced,completed,64,64,67,65.00,195
9,female,group B,high school,free/reduced,none,38,60,50,49.33,148

In [10]:
parent_education = dataset['parental level of education'].value_counts()

In [13]:
parent_education

some college          226
associate's degree    222
high school           196
some high school      179
bachelor's degree     118
master's degree        59
Name: parental level of education, dtype: int64

In [11]:
type(parent_education)

pandas.core.series.Series

In [14]:
parent_education.min()

59

In [19]:
## Sort DataFrame --defining the order of sort!
dataset.sort_values(by=["Grand Total Score","math score","gender"],ascending=False)

,gender,race/ethnicity,parental level of education,lunch,test preparation course,math score,reading score,writing score,Student Average Score,Grand Total Score
916,male,group E,bachelor's degree,standard,completed,100,100,100,100.00,300
458,female,group E,bachelor's degree,standard,none,100,100,100,100.00,300
962,female,group E,associate's degree,standard,none,100,100,100,100.00,300
114,female,group E,bachelor's degree,standard,completed,99,100,100,99.67,299
712,female,group D,some college,standard,none,98,100,99,99.00,297
...,...,...,...,...,...,...,...,...,...,...
17,female,group B,some high school,free/reduced,none,18,32,28,26.00,78
327,male,group A,some college,free/reduced,none,28,23,19,23.33,70
596,male,group B,high school,free/reduced,none,30,24,15,23.00,69
980,female,group B,high school,free/reduced,none,8,24,23,18.33,55
59,female,group C,some high school,free/reduced,none,0,17,10,9.00,27

In [23]:
##using lambda function to convert into lower case before perform sort
dataset.sort_values(by=["parental level of education"], ascending=True,
                   key=lambda coln: coln.str.lower())

,gender,race/ethnicity,parental level of education,lunch,test preparation course,math score,reading score,writing score,Student Average Score,Grand Total Score
669,male,group D,associate's degree,standard,completed,81,72,77,76.67,230
457,male,group D,associate's degree,free/reduced,none,53,54,48,51.67,155
454,female,group C,associate's degree,free/reduced,none,53,61,62,58.67,176
452,female,group C,associate's degree,free/reduced,none,65,77,74,72.00,216
173,female,group C,associate's degree,standard,none,63,67,70,66.67,200
...,...,...,...,...,...,...,...,...,...,...
513,female,group B,some high school,standard,completed,54,61,62,59.00,177
515,female,group C,some high school,standard,completed,76,87,85,82.67,248
265,male,group D,some high school,free/reduced,none,59,42,41,47.33,142
853,male,group E,some high school,standard,none,82,67,61,70.00,210
336,male,group D,some high school,standard,completed,76,70,69,71.67,215